# StructuralSectionAnalysisParams Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionAnalysisParams Class
Members See Also
---
Defines common set of parameters for structural analysis.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class StructuralSectionAnalysisParams : IDisposable
```

Visual Basic
---
```text
Public Class StructuralSectionAnalysisParams _
	Implements IDisposable
```

Visual C++
---
```text
public ref class StructuralSectionAnalysisParams : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionAnalysisParams
# See Also
StructuralSectionAnalysisParams Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace